html/20231126T014740--python-development-in-emacs__emacs_python.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>python development in emacs</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231126T014740--python-development-in-emacs__emacs_python.html">python development in emacs</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge386948">1. Dependencies</a></li>
<li><a href="#orgff2b897">2. Commands</a></li>
<li><a href="#orgc0a97ae">3. virtual env</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orge386948" class="outline-2">
<h2 id="orge386948"><span class="section-number-2">1.</span> Dependencies</h2>
<div class="outline-text-2" id="text-1">
<p>
Simple python dev environment that does the job(without lsp)
</p>

<p>
Skybert paaiskinimas
<a href="https://www.youtube.com/watch?v=JmmTUIahB1U&amp;ab_channel=SkybertHacks">https://www.youtube.com/watch?v=JmmTUIahB1U&amp;ab_channel=SkybertHacks</a>
</p>

<p>
Maybe dont even touch LSP FOR PYTHON.
</p>

<p>
simply create environment with pyvenv-create
then pyvenv-workon
then install the the needed packages that are described in elpy-config
pip3 install jedi autopep8 yapf black flake8 ipython importmagic
</p>

<p>
ipython - IPython is generally considered more feature-rich and
provides a more interactive and convenient experience. If you prefer
advanced features like tab completion, syntax highlighting, and
command history, IPython may be a better choice.
</p>

<p>
set this: basically is what you get when doing ctrl+ret on a piece of
code. looks more fancy, indeed, that python3 interpreter.
</p>

<div class="org-src-container">
<pre class="src src-bash">(setq python-shell-interpreter "ipython"
      python-shell-interpreter-args "-i --simple-prompt")
</pre>
</div>

<p>
importmagic - Importmagic helps simplify the process by automatically analyzing
your code and suggesting or making changes to import statements based on the
modules and symbols used in your code. It can detect missing imports, remove
unused imports, and reorder existing imports according to a specified style or
convention.
</p>

<p>
if want auto-completion, warnings, navigation, IDE features like
rename - get eglot like here -
<a href="https://www.youtube.com/watch?v=JmmTUIahB1U&amp;ab_channel=SkybertHacks">https://www.youtube.com/watch?v=JmmTUIahB1U&amp;ab_channel=SkybertHacks</a>
</p>

<p>
and that's it, lets get rolling.
</p>

<p>
have syntax highlights, corrections, completions, jumping to definitions etc.
very nice and simple.
</p>

<p>
LSP will be using for JS development and etc.
</p>

<hr>
<p>
LSP setup below(did not work)
</p>

<ul class="org-ul">
<li>LSP package and config</li>
<li>sudo apt install python3 (for python development)</li>
<li>apt install python3.10-venv (for python development)</li>
<li>Install a python language server - <a href="https://emacs-lsp.github.io/lsp-mode/page/lsp-pylsp/">https://emacs-lsp.github.io/lsp-mode/page/lsp-pylsp/</a></li>
<li>berods dariau pip install "python-lsp-server[all]"</li>
<li>paskui sitas sudo apt install pipenv</li>
<li>create a python file</li>
<li>create a virtual environment with python3 -m venv &lt;nameOfEnv&gt; (or
can do with pyvenv-create, then it will create virtual environment
in ~/.virtualenvs folder)</li>
<li>Open emacs, do pyvenv-activate when you are inside the folder
containing &lt;nameOfEnv&gt;</li>
<li>open terminal in emacs (shell, eshell, ansi-term, term) and do which
python. You should see the &lt;nameOfEnv&gt; location. If you want to
disable that env, do pyvenv-deactivate. Terminal will still have the
&lt;nameOfEnv&gt; active, so might need to restart the terminal as well.</li>
<li>But then you will still get some sentinel error 1 errors</li>
<li>Lets see elpy config</li>
</ul>

<hr>
<p>
more elpy docs:
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-02-20 Sun] </span></span> TUT: "Elpy" - various python modes for easier python
programming. Installs various other packages as well. A few videos to help
install elpy and customize.
</p>

<p>
<a href="https://www.youtube.com/watch?v=0kuCeS-mfyc">https://www.youtube.com/watch?v=0kuCeS-mfyc</a>,
<a href="https://www.youtube.com/watch?v=mflvdXKyA_g">https://www.youtube.com/watch?v=mflvdXKyA_g</a>
<a href="https://elpy.readthedocs.io/en/latest/index.html">https://elpy.readthedocs.io/en/latest/index.html</a>
</p>

<p>
When using tab auto completion, click f1 and get the explanation in another
buffer. Company doccumentation window. and of course more amazing <a href="https://gist.github.com/mahyaret/a64d209d482fc0f5eca707f12ccce146">shortcuts</a>
Here.
</p>

<p>
If documentation suggestions get annoying - turn off eldoc mode
</p>

<p>
INSTALL:
</p>
<ol class="org-ol">
<li>sudo pip install elpy rope jedi</li>
<li>add export PATH=$PATH:~/.local/bin to your .bashrc file and reload
Emacs.</li>
<li>should get a message asking something about RPC, click yes.</li>
<li>then make sure jedi is installed in your system. others use flake8,
others use jedi.. idk. zamansky and the guy from he tutorial video
use jedi.</li>
<li>do M-x elpy-config to see the config</li>
<li>check your .emacs.d folder. if there is one called "elpy" and it is
empty or something, do M-x elpy-rpc-restart. Folders will appear,
packages will install. Then do elpy-config</li>
<li>pip install flake8 - get to see more syntax checks. M-x elpy-config
to confirm its installed</li>
</ol>
</div>
</div>

<div id="outline-container-orgff2b897" class="outline-2">
<h2 id="orgff2b897"><span class="section-number-2">2.</span> Commands</h2>
<div class="outline-text-2" id="text-2">
<p>
lsp-doctor
lsp-install server
</p>
</div>
</div>

<div id="outline-container-orgc0a97ae" class="outline-2">
<h2 id="orgc0a97ae"><span class="section-number-2">3.</span> virtual env</h2>
<div class="outline-text-2" id="text-3">
<p>
~/.virtualenvs/ - cia guli visos virtual env
</p>

<ul class="org-ul">
<li>ijunk emacs ir iskart daryk pyvenv workon</li>
<li>pip list(ar viso kompo info ziuri ar tik env environment)</li>
<li>pyvenv-workon - create a virtual env in a folder</li>
<li>pip list</li>
<li>elpy config - susiinstallink visus packages</li>
</ul>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> <a href="https://arvydasg.github.io/devnotes/html/tag-python.html">python</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
